backend/app/controllers/api/v1/chinchillas_controller.rb

SELECT `chinchillas`.* FROM `chinchillas` WHERE `chinchillas`.`user_id` = 2
---
  def index
    user_id = current_api_v1_user.id
    chinchillas = Chinchilla.where(user_id: user_id)

INSERT INTO `chinchillas` (`chinchilla_name`, `chinchilla_sex`, `chinchilla_birthday`, `chinchilla_met_day`, `chinchilla_memo`, `chinchilla_image`, `user_id`, `created_at`, `updated_at`) VALUES ('ポンチョ', 'オス', NULL, NULL, NULL, NULL, 2, '2023-07-30 09:24:35.555376', '2023-07-30 09:24:35.555376')
---
  def create
    chinchilla = Chinchilla.new(chinchilla_params)
    chinchilla.user_id = current_api_v1_user.id

    if chinchilla.save!